adafruit/tinyuf2/ports/mimxrt10xx/apps/factory_test/main.c
/*
 * The MIT License (MIT)
 *
 * Copyright (c) 2020 Ha Thach (tinyusb.org) for Adafruit Industries
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in
 * all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
 * THE SOFTWARE.
 */

#include <stdlib.h>
#include <stdio.h>
#include <stdbool.h>
#include <string.h>
#include <stdarg.h>


#include "fsl_gpio.h"
#include "fsl_iomuxc.h"
#include "fsl_lpuart.h"

#include "board_api.h"
#include "tusb.h"
#include "arduino.h"

uint8_t all_pins[] = {0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, PIN_SDA, PIN_SCL};

bool testpins(uint8_t a, uint8_t b, uint8_t *allpins, uint8_t num_allpins);

/* This is an application to test Metro M7
 */

//--------------------------------------------------------------------+
// MACRO TYPEDEF CONSTANT ENUM DECLARATION
//--------------------------------------------------------------------+

// optional API, not included in board_api.h
int board_uart_read(uint8_t* buf, int len);


int main(void)
{
  board_init();
  board_uart_init(115200);

  board_timer_start(1);

  board_usb_init();
  tusb_init();

  uint8_t rgb[3] = { 20, 20, 0 };
  board_rgb_write(rgb);

  pinMode(13, OUTPUT);

  while(1)
  {
    Serial_printf("\n\r\n\rHello Metro M7 iMX RT1011 Test! %d\n\r", millis());
    digitalWrite(13, HIGH);
    delay(100);
    digitalWrite(13, LOW);
    
    if ( !testpins(0, 2, all_pins, sizeof(all_pins))) continue;
    if ( !testpins(1, 3, all_pins, sizeof(all_pins))) continue;
    if ( !testpins(4, 6, all_pins, sizeof(all_pins))) continue;
    if ( !testpins(5, 7, all_pins, sizeof(all_pins))) continue;
    if ( !testpins(8, 10, all_pins, sizeof(all_pins))) continue;
    if ( !testpins(9, 11, all_pins, sizeof(all_pins))) continue;
    if ( !testpins(12, PIN_SDA, all_pins, sizeof(all_pins))) continue; 
    if ( !testpins(13, PIN_SCL, all_pins, sizeof(all_pins))) continue;
    if ( !testpins(PIN_MOSI, PIN_MISO, all_pins, sizeof(all_pins))) continue;
    if ( !testpins(PIN_SCK, AD5, all_pins, sizeof(all_pins))) continue;

    Serial_printf("*** TEST OK! ***\n\r");
    delay(100);


    /*
    // USB -> UART
    while( tud_cdc_available() )
    {
      count = tud_cdc_read(serial_buf, sizeof(serial_buf));
      board_uart_write(serial_buf, count);

      uint8_t rgb[3] = { 10, 0, 0 };
      board_rgb_write(rgb);
    }

    // UART -> USB
    count = board_uart_read(serial_buf, sizeof(serial_buf));
    if (count)
    {
      tud_cdc_write(serial_buf, count);
      tud_cdc_write_flush();

      uint8_t rgb[3] = { 0, 0, 10 };
      board_rgb_write(rgb);
    }
    */
    tud_task();
  }
}


//--------------------------------------------------------------------+
// Logger newlib retarget
//--------------------------------------------------------------------+

// Enable only with LOG is enabled (Note: ESP32-S2 has built-in support already)
#if TUF2_LOG // && (CFG_TUSB_MCU != OPT_MCU_ESP32S2)

#if defined(LOGGER_RTT)
#include "SEGGER_RTT.h"
#endif

__attribute__ ((used)) int _write (int fhdl, const void *buf, size_t count)
{
  (void) fhdl;

#if defined(LOGGER_RTT)
  SEGGER_RTT_Write(0, (char*) buf, (int) count);
  return count;
#else
  return board_uart_write(buf, count);
#endif
}

#endif





bool testpins(uint8_t a, uint8_t b, uint8_t *allpins, uint8_t num_allpins) {
  bool ok = false;

  Serial_printf("\tTesting %d and %d\n\r", a, b);

  // set both to inputs
  pinMode(b, INPUT);
  // turn on 'a' pullup
  pinMode(a, INPUT_PULLUP);
  delay(1);

  // verify neither are grounded
  if (!digitalRead(a) || !digitalRead(b)) {
    Serial_printf("Ground test 1 fail: both pins should not be grounded");
    return false;
  }

  for (int retry=0; retry<3 && !ok; retry++) {
    // turn off both pullups
    pinMode(a, INPUT);
    pinMode(b, INPUT);
    
    // make a an output
    pinMode(a, OUTPUT);
    digitalWrite(a, LOW);
    delay(1);
    
    int ar = digitalRead(a);
    int br = digitalRead(b);
    delay(5);
    
    // make sure both are low
    if (ar || br) {
      Serial_printf("Low test fail on pin #");
      if (ar) Serial_printf("%d\n\r", a);
      if (br) Serial_printf("%d\n\r", b);
      ok = false;
      continue;
    }
    ok = true;
  }
  if (!ok) return false;

  ok = false;
  for (int retry=0; retry<3 && !ok; retry++) {
    //theSerial->println("OK!");
    // a is an input, b is an output
    pinMode(a, INPUT);
    pinMode(b, OUTPUT);
    digitalWrite(b, HIGH);
    delay(10);
    
    // verify neither are grounded
    if (!digitalRead(a)|| !digitalRead(b)) {
      Serial_printf("Ground test 2 fail: both pins should not be grounded");
      delay(100);
      ok = false;
      continue;
    }
    ok = true;
  }
  if (!ok) return false;

  // make sure no pins are shorted to pin a or b
  for (uint8_t i = 0; i < num_allpins; i++) {
    pinMode(allpins[i], INPUT_PULLUP);
  }

  pinMode(a, OUTPUT);
  digitalWrite(a, LOW);
  pinMode(b, OUTPUT);
  digitalWrite(b, LOW);
  delay(1);

  for (uint8_t i = 0; i < num_allpins; i++) {
    if ((allpins[i] == a) || (allpins[i] == b)) {
      continue;
    }

    // theSerial->print("Pin #"); theSerial->print(allpins[i]);
    // theSerial->print(" -> ");
    // theSerial->println(digitalRead(allpins[i]));
    if (!digitalRead(allpins[i])) {
      Serial_printf("%d is shorted?\n\r", allpins[i]);

      return false;
    }
  }
  pinMode(a, INPUT);
  pinMode(b, INPUT);
  
  delay(10);

  return true;
}

